package dfs

/*
给你一个由 '1'（陆地）和 '0'（水）组成的的二维网格，请你计算网格中岛屿的数量。
岛屿总是被水包围，并且每座岛屿只能由水平方向和/或竖直方向上相邻的陆地连接形成。
此外，你可以假设该网格的四条边均被水包围。

示例 1：
输入：grid = [
  ["1","1","1","1","0"],
  ["1","1","0","1","0"],
  ["1","1","0","0","0"],
  ["0","0","0","0","0"]
]
输出：1

示例 2：
输入：grid = [
  ["1","1","0","0","0"],
  ["1","1","0","0","0"],
  ["0","0","1","0","0"],
  ["0","0","0","1","1"]
]
输出：3
*/

func NumIslands(grid [][]byte) int {
	res := 0
	var dfs func(i, j int)
	dfs = func(i, j int) {
		// 在二维数组范围内,如果值为1,递归其周围的元素
		if i >= 0 && i < len(grid[0]) && j >= 0 && j < len(grid) && grid[j][i] == '1' {
			grid[j][i] = 0
			dfs(i, j+1)
			dfs(i, j-1)
			dfs(i+1, j)
			dfs(i-1, j)

		}
	}
	for i := 0; i < len(grid[0]); i++ {
		for j := 0; j < len(grid); j++ {
			// 递归值为1的元素周围所有的1
			if grid[j][i] == '1' {
				dfs(i, j)
				res++
			}
		}
	}
	return res
}
